/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   bsq.h                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tpulaski <tpulaski@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/09/27 12:25:18 by tpulaski          #+#    #+#             */
/*   Updated: 2020/09/29 16:05:36 by tpulaski         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef BSQ_H
# define BSQ_H

typedef struct	s_point
{
	int		x;
	int		у;
}				t_point;

typedef struct	s_map
{
	char	*data;
	int		size_x;
	int		size_y;
	char	empty;		// символ свободного поля
	char	obstacle;	// символ препядствия
	char	fill;		// символ завполнения поля макс. прямоугольника
	int		rect_x;		// коорд. макс. прямоугольника
	int		rect_y;		// коорд. макс. прямоугольника
	int		rect_size_x;// размер макс. прямоуг.
	int		rect_size_y;// размер макс. прямоуг.
}				t_map;

t_map	map;		// глобальная переменная с исходной картой
int		*map_res;	// глобальная переменная с результатами поиска прямоугольников

#endif
